<template>
    <section class="tour-header">
        <img :src="tour.img" alt="Tour Image" class="tour__img">
        <div class="tour__item">
            <div class="tour__content">
                <div class="tour__info">
                    <h1 class="tour__title">{{ tour.title }}</h1>
                    <p class="tour__desc">{{ tour.desc }}</p>
                </div>
            </div>
        </div>
    </section>

    <section class="programm">
        <div class="programm__item container">
            <h1 class="programm__title">{{ tour.stitle }}</h1>
            <div class="programm__title-underline"></div>
            <div class="programm__content">
                <div class="programm__card">
                    <h2 class="programm__stitle">{{ tour.sstitle }}</h2>
                    <p class="programm__desc">{{ tour.ssdesc }}</p>
                </div>
                <div class="programm__card">
                    <h2 class="programm__stitle">{{ tour.sstitle1 }}</h2>
                    <p class="programm__desc">{{ tour.ssdesc1 }}</p>
                </div>
                <div class="programm__card">
                    <h2 class="programm__stitle">{{ tour.sstitle2 }}</h2>
                    <p class="programm__desc">{{ tour.ssdesc2 }}</p>
                </div>
            </div>
        </div>
    </section>

</template>

<script setup>
import { ref, onMounted } from 'vue';
import { useRoute } from 'vue-router';

const route = useRoute();
const items = ref([
    {
        img: require('@/assets/img/dubai.jpg'),
        sdesc: 'supertour',
        title: 'Дубай',
        desc:
        'Приглашаем вас в незабываемое путешествие в Дубай — один из самых ярких и современных городов мира. Этот тур подарит вам уникальную возможность насладиться великолепием архитектуры, богатством культуры и захватывающими развлечениями, которые предлагает Дубай.',
        stitle: 'Программа тура',
        sstitle: 'День 1: Прилет в Дубай',
        sstitle1: 'День 2: Обзорная экскурсия по Дубаю',
        sstitle2: 'День 3: Пустынное приключение',
        ssdesc: 'Встреча с гидом в аэропорту. Трансфер в отель и размещение. Свободное время для отдыха или прогулок по окрестностям.',
        ssdesc1: 'Посещение знаменитых достопримечательностей: Бурдж Халифа, Дубай Молл и фонтанов Дубая. Прогулка по историческому району Аль-Фахиди и посещение Дубайского музея. Ужин в традиционном арабском ресторане.',
        ssdesc2: 'Экскурсия в пустыню: сафари на джипах, катание на верблюдах и вечернее шоу с танцем живота. Ужин под звездами с традиционными блюдами.',
    },
    {
        img: require('@/assets/img/thailand.jpg'),
        sdesc: 'supertour',
        title: 'Таиланд',
        desc: 'Приглашаем вас в захватывающее путешествие в Таиланд — страну, известную своими потрясающими пляжами, богатой культурой и дружелюбными людьми. Этот тур подарит вам уникальную возможность насладиться великолепием природы, историческими памятниками и вкусной тайской кухней.',
        stitle: 'Программа тура',
        sstitle: 'День 1: Прилет в Бангкок',
        sstitle1: 'День 2: Обзорная экскурсия по Бангкоку',
        sstitle2: 'День 3: Путешествие в Аюттхаю',
        ssdesc: 'Встреча с представителем в аэропорту. Трансфер в отель и размещение. Свободное время для отдыха или прогулок по вечернему Бангкоку.',
        ssdesc1: 'Посещение Храма Изумрудного Будды и Королевского дворца. Прогулка по рынку Чатучак и возможность попробовать местные деликатесы. Вечерняя экскурсия на лодке по реке Чао Прайя.',
        ssdesc2: 'Экскурсия в древнюю столицу Таиланда — Аюттхаю. Посещение исторических храмов и памятников UNESCO. Ужин с традиционными тайскими блюдами.',
    },
    {
        img: require('@/assets/img/turkey.jpg'),
        sdesc: 'supertour',
        title: 'Турция',
        desc: 'Приглашаем вас в увлекательное путешествие по Турции — стране, где встречаются восточные традиции и западная культура. Этот тур подарит вам возможность исследовать исторические памятники, насладиться великолепными пейзажами и попробовать вкуснейшую турецкую кухню.',
        stitle: 'Программа тура',
        sstitle: 'День 1: Прилет в Стамбул',
        sstitle1: 'День 2: Обзорная экскурсия по Стамбулу',
        sstitle2: 'День 3: Путешествие в Каппадокию',
        ssdesc: 'Встреча с представителем в аэропорту. Трансфер в отель и размещение. Свободное время для прогулок по вечернему Стамбулу.',
        ssdesc1: 'Посещение знаменитых достопримечательностей: Собор Святой Софии, Голубая мечеть и Дворец Топкапы. Прогулка по Гранд-базару — одному из крупнейших крытых рынков мира. Ужин в традиционном ресторане с видом на Босфор.',
        ssdesc2: 'Утренний перелет в Каппадокию. Экскурсия по уникальным ландшафтам: скальные образования, подземные города и древние церкви. Вечерний полет на воздушном шаре над Каппадокией (при наличии).',
    },
    {
        img: require('@/assets/img/maldives.jpg'),
        sdesc: 'supertour',
        title: 'Мальдивы',
        desc: 'Приглашаем вас в незабываемое путешествие на Мальдивы — архипелаг, известный своими белоснежными пляжами, кристально чистыми водами и роскошными курортами. Этот тур подарит вам возможность насладиться спокойствием, романтикой и красотой тропического рая.',
        stitle: 'Программа тура',
        sstitle: 'День 1: Прилет на Мальдивы',
        sstitle1: 'День 2: Отдых на пляже и водные виды спорта',
        sstitle2: 'День 3: Экскурсия на соседний остров',
        ssdesc: 'Встреча с представителем в аэропорту. Трансфер на гидросамолете или катере до отеля на одном из островов. Размещение в отеле и свободное время для отдыха на пляже.',
        ssdesc1: 'Утренний завтрак с видом на океан. Возможность заняться водными видами спорта: сноркелинг, дайвинг, каякинг или серфинг. Вечерний ужин на пляже под звездами.',
        ssdesc2: 'Посещение местного острова для знакомства с культурой и образом жизни мальдивцев. Прогулка по рынкам, возможность приобрести сувениры и попробовать местные блюда. Возвращение в отель и свободное время.',
    },
    {
        img: require('@/assets/img/egypt.jpg'),
        sdesc: 'supertour',
        title: 'Египет',
        desc: 'Приглашаем вас в увлекательное путешествие в Египет — страну, полную древних тайн и великолепных пейзажей. Этот тур позволит вам исследовать величественные пирамиды, насладиться красотой Нила и погрузиться в уникальную культуру и историю.',
        stitle: 'Программа тура',
        sstitle: 'День 1: Прилет в Каир',
        sstitle1: 'День 2: Обзорная экскурсия по Каиру',
        sstitle2: 'День 3: Путешествие в Луксор',
        ssdesc: 'Встреча с представителем в аэропорту. Трансфер в отель и размещение. Свободное время для отдыха или вечерней прокулки по городу',
        ssdesc1: 'Посещение знаменитых пирамид Гизы и Сфинкса. Экскурсия в Египетский музей, где хранятся сокровища Тутанхамона. Ужин в традиционном ресторане с местной кухней.',
        ssdesc2: 'Утренний перелет в Луксор. Посещение Долины Царей и храма Хатшепсут. Прогулка по храму Карнака и вечерняя экскурсия на лодке по Нилу.',
    },
]);

const tour = ref({});

onMounted(() => {
    const tourId = parseInt(route.params.id);
    tour.value = items.value[tourId];
});
</script>

<style lang="scss" scoped>


</style>